### Target Guided Ordinal Encoding

In [1]:
import pandas as pd
# create a dataframe  with categorical variable and target variable 
df=pd.DataFrame({
    "city":['new york','london','paris','tokyo','new york','paris'],
    "price":[200,150,300,250,180,320]})

In [2]:
df

       city  price
0  new york    200
1    london    150
2     paris    300
3     tokyo    250
4  new york    180
5     paris    320

In [ ]:
# we will convert categorical variable (city) based on the target variable (price)
# like , new york has 2 different value we will take mean of both value

In [3]:
df.groupby('city')['price'].mean()

city
london      150.0
new york    190.0
paris       310.0
tokyo       250.0
Name: price, dtype: float64

In [4]:
mean_price=df.groupby('city')['price'].mean().to_dict()

In [5]:
mean_price

{'london': 150.0, 'new york': 190.0, 'paris': 310.0, 'tokyo': 250.0}

In [6]:
df['city_encoded']=df['city'].map(mean_price)

In [7]:
df

       city  price  city_encoded
0  new york    200         190.0
1    london    150         150.0
2     paris    300         310.0
3     tokyo    250         250.0
4  new york    180         190.0
5     paris    320         310.0

In [8]:
df[['price','city_encoded']]

   price  city_encoded
0    200         190.0
1    150         150.0
2    300         310.0
3    250         250.0
4    180         190.0
5    320         310.0